allergnes/app/views/ingredients/show.html.erb

SELECT "recipes".* FROM "recipes" INNER JOIN "amounts" ON "recipes"."id" = "amounts"."recipe_id" WHERE "amounts"."ingredient_id" = ?  [["ingredient_id", 3]]
---
    <label> RECIPES </label>
    <% @ingredient.recipes.each do |recipe| %>