allergnes/app/controllers/recipes_controller.rb

SELECT "users".* FROM "users"
---
    def new
        @recipe = Recipe.new
        @users = User.all

INSERT INTO "recipes" ("name", "user_id") VALUES (?, ?)  [["name", "Bug Sauce"], ["user_id", 2]]
---
    def create
        @recipe = Recipe.create({
            name: params[:recipe][:name],
            user_id: params[:recipe][:user_id]
        })