allergnes/app/controllers/users_controller.rb

INSERT INTO "users" ("name") VALUES (?)  [["name", "Tommy"]]
---
    def create
        @user = User.create({
        name: params[:user][:name]
        })

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]
---
    def destroy
        @user = User.find(params[:id])
        @user.delete